nxp-mcuxpresso/mcux-devices-dsc/MC56F81xxx/MC56F81646/drivers/fsl_flash.h
/*
 * Copyright 2019 - 2022 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef FSL_FLASHIAP_H
#define FSL_FLASHIAP_H

#include "fsl_common.h"

/*!
 * @defgroup flash_driver Flash Driver
 * @details The flash driver provides general APIs to handle specific operations on chip flash;
 *          The user can use those APIs directly in the application.
 *          The flash supports:
 *          - Initialize the global flash
 *          - Erase flash region.
 *          - Program data to flash.
 * @{
 */

/*********************************************************************************************************************
 *                               Driver change logs
 *********************************************************************************************************************/

/*!
 * @defgroup flash_driver_log Driver Change Log
 * @ingroup flash_driver
 * @{
 * The current FLASH driver version is 3.3.0.
 *
 * - 3.3.0
 *   - Use unified entry to invoke ROM flash API
 *
 * - 3.2.0
 *   - Change file name to fsl_flash.x
 *
 * - 3.1.0
 *   - Accumulated bug fix
 *   - MISRA warning fix
 *
 * - 3.0.0
 *   - Initial version.
 * @}
 */

/*********************************************************************************************************************
 *                               Variable types
 *********************************************************************************************************************/
typedef status_t flash_status_t;

/*!
 * @name Flash version
 * @{
 */
/*! @brief Flash driver version for SDK*/
#define FSL_FLASH_DRIVER_VERSION (MAKE_VERSION(3U, 3U, 0U))

/*! @brief Flash driver version for ROM*/
#define FSL_FLASH_DRIVER_VERSION_ROM (MAKE_VERSION(3U, 3U, 0U))

/*! @brief Flash driver version for ROM*/
enum _flash_driver_version_constants
{
    kFLASH_DriverVersionName   = 'F', /*!< Flash driver version name.*/
    kFLASH_DriverVersionMajor  = 3,   /*!< Major flash driver version.*/
    kFLASH_DriverVersionMinor  = 0,   /*!< Minor flash driver version.*/
    kFLASH_DriverVersionBugfix = 0    /*!< Bugfix for flash driver version.*/
};

/* @brief Structure of version property.*/
typedef union _standard_version
{
    struct
    {
        uint8_t bugfix; /* bugfix version [7:0] */
        uint8_t minor;  /* minor version [15:8] */
        uint8_t major;  /* major version [23:16] */
        char name;      /* name [31:24] */
    } B;
    uint32_t version;   /* combined version numbers */
} standard_version_t;

/*@}*/

/*********************************************************************************************************************
 *                               enumeration and structure types definition for input parameter
 *********************************************************************************************************************/

/*!
 * @brief Enumeration for FLASH driver API keys.
 *
 * @note The resulting value is built with a byte order such that the string
 * being readable in expected order when viewed in a hex editor, if the value
 * is treated as a 32-bit little endian value.
 */
enum _flash_driver_api_keys
{
    kFLASH_ApiEraseKey = 0x6B65666BUL
};

/*!
 * @brief Enumeration for the two possible options of flash read resource command.
 */
typedef enum _flash_read_resource_opt
{
    kFLASH_ResourceOptionFlashIfr =
        0x00U, /*!< Select code for Program flash 0 IFR, Program flash swap 0 IFR, Data flash 0 IFR */
    kFLASH_ResourceOptionVersionId = 0x01U /*!< Select code for the version ID*/
} flash_read_resource_opt_t;

/*!
 * @brief Enumeration for supported FTFx margin levels.
 */
typedef enum _flash_margin_value
{
    kFLASH_MarginValueNormal,  /*!< Use the 'normal' read level for 1s.*/
    kFLASH_MarginValueUser,    /*!< Apply the 'User' margin to the normal read-1 level.*/
    kFLASH_MarginValueFactory, /*!< Apply the 'Factory' margin to the normal read-1 level.*/
    kFLASH_MarginValueInvalid  /*!< Not real margin level, Used to determine the range of valid margin level. */
} flash_margin_value_t;

/*!
 * @brief Enumeration for the three possible FTFx security states.
 */
typedef enum _flash_security_state
{
    kFLASH_SecurityStateNotSecure        = 0xc33cc33cU, /*!< Flash is not secure.*/
    kFLASH_SecurityStateBackdoorEnabled  = 0x5aa55aa5U, /*!< Flash backdoor is enabled.*/
    kFLASH_SecurityStateBackdoorDisabled = 0x5ac33ca5U  /*!< Flash backdoor is disabled.*/
} flash_security_state_t;

/*!
 * @brief Enumeration for FTFx memory type.
 */
enum _flash_memory_type
{
    kFLASH_MemTypePflash  = 0x00U,
    kFLASH_MemTypeFlexnvm = 0x01U
};

/*!
 * @brief ftfx special memory access information.
 */
typedef struct _flash_special_mem
{
    uint32_t base;  /*!< Base address of flash special memory.*/
    uint32_t size;  /*!< size of flash special memory.*/
    uint32_t count; /*!< flash special memory count.*/
} flash_spec_mem_t;

/*!
 * @brief Flash memory descriptor.
 */
typedef struct _flash_mem_desc_t
{
    uint8_t type;  /*!< Type of flash block.*/
    uint8_t index; /*!< Index of flash block.*/
    uint8_t reserved[2];
    struct
    {
        uint32_t isIndBlock : 1;
        uint32_t hasIndPfsizeReg : 1;
        uint32_t hasProtControl : 1;
        uint32_t hasIndProtReg : 1;
        uint32_t hasXaccControl : 1;
        uint32_t hasIndXaccReg : 1;
        uint32_t : 18;
        uint32_t ProtRegBits : 8;
    } feature;
    uint32_t blockBase;  /*!< A base address of the flash block */
    uint32_t totalSize;  /*!< The size of the flash block. */
    uint32_t sectorSize; /*!< The size in bytes of a sector of flash. */
    uint32_t blockCount; /*!< A number of flash blocks. */
    flash_spec_mem_t accessSegmentMem;
    flash_spec_mem_t protectRegionMem;
} flash_mem_desc_t;

/*!
 * @brief Active FTFx information for the current operation.
 */
typedef struct _flash_ops_config
{
    uint32_t convertedAddress; /*!< A converted address for the current flash type.*/
    struct
    {
        uint8_t sectorCmd;
        uint8_t sectionCmd;
        uint8_t resourceCmd;
        uint8_t checkCmd;
        uint8_t swapCtrlCmd;
        uint8_t blockWriteUnitSize;
        uint8_t reserved[2];
    } addrAligment;
} flash_ops_config_t;

/*!
 * @brief Flash IFR memory descriptor.
 */
typedef struct _flash_ifr_desc
{
    struct
    {
        uint32_t has4ByteIdxSupport : 1;
        uint32_t has8ByteIdxSupport : 1;
        uint32_t : 30;
    } feature;
    struct
    {
        uint8_t versionIdStart;
        uint8_t versionIdSize;
        uint16_t ifrMemSize;
        uint32_t pflashIfrStart;
        uint32_t dflashIfrStart;
        uint32_t pflashSwapIfrStart;
    } resRange;
    struct
    {
        uint16_t mix8byteIdxStart;
        uint16_t mix8byteIdxEnd;
    } idxInfo;
} flash_ifr_desc_t;

/*! @brief Flash driver state information.
 *
 * An instance of this structure is allocated by the user of the flash driver and
 * passed into each of the driver APIs.
 */
typedef struct _ftfx_config
{
    flash_mem_desc_t flashDesc;
    flash_ops_config_t opsConfig;
    uint32_t flexramBlockBase; /*!< The base address of the FlexRAM/acceleration RAM */
    uint32_t flexramTotalSize; /*!< The size of the FlexRAM/acceleration RAM */
    uint16_t eepromTotalSize;  /*!< The size of EEPROM area which was partitioned from FlexRAM */
    uint16_t reserved;
    uint32_t *runCmdFuncAddr;  /*!< An buffer point to the flash execute-in-RAM function. */
    flash_ifr_desc_t ifrDesc;
} ftfx_config_t;

